#### Task 1

In [10]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Turgenev', 'Chehov', 'Ostrovskiy']}, columns=['author_id', 'author_name'])

In [4]:
authors

   author_id author_name
0          1    Turgenev
1          2      Chehov
2          3  Ostrovskiy

In [5]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Fathers and Sons', 'Rudin', 'Home of the Gentry', 'Fat and Thin', 'The Lady with the Dog', 'The Storm', 'Talents and Admirers'], 'price':[450, 300, 350, 500, 450, 370, 290]})

In [6]:
book

   author_id             book_title  price
0          1       Fathers and Sons    450
1          1                  Rudin    300
2          1     Home of the Gentry    350
3          2           Fat and Thin    500
4          2  The Lady with the Dog    450
5          3              The Storm    370
6          3   Talents and Admirers    290

#### Task 2

In [7]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')

In [9]:
authors_price

   author_id author_name             book_title  price
0          1    Turgenev       Fathers and Sons    450
1          1    Turgenev                  Rudin    300
2          1    Turgenev     Home of the Gentry    350
3          2      Chehov           Fat and Thin    500
4          2      Chehov  The Lady with the Dog    450
5          3  Ostrovskiy              The Storm    370
6          3  Ostrovskiy   Talents and Admirers    290

#### Task 3

In [11]:
top5 = authors_price.nlargest(5, 'price')

In [12]:
top5

   author_id author_name             book_title  price
3          2      Chehov           Fat and Thin    500
0          1    Turgenev       Fathers and Sons    450
4          2      Chehov  The Lady with the Dog    450
5          3  Ostrovskiy              The Storm    370
2          1    Turgenev     Home of the Gentry    350

#### Task 4

In [13]:
min_price = authors_price.groupby('author_name').agg({'price': 'min'})

In [14]:
min_price

             price
author_name
Chehov         450
Ostrovskiy     290
Turgenev       300

In [16]:
max_price = authors_price.groupby('author_name').agg({'price': 'max'})

In [18]:
max_price

             price
author_name
Chehov         500
Ostrovskiy     370
Turgenev       450

In [19]:
mean_price = authors_price.groupby('author_name').agg({'price': 'mean'})

In [20]:
mean_price

                  price
author_name
Chehov       475.000000
Ostrovskiy   330.000000
Turgenev     366.666667

In [25]:
authors_stat = pd.concat([min_price, max_price, mean_price], axis=1, ignore_index=True)

In [26]:
authors_stat

               0    1           2
author_name
Chehov       450  500  475.000000
Ostrovskiy   290  370  330.000000
Turgenev     300  450  366.666667

In [27]:
authors_stat = authors_stat.rename(columns={0:'min_price', 1:'max_price',2:'mean_price'})

In [28]:
authors_stat

             min_price  max_price  mean_price
author_name
Chehov             450        500  475.000000
Ostrovskiy         290        370  330.000000
Turgenev           300        450  366.666667